___

<a href='http://www.pieriandata.com'> <img src='../../Pierian_Data_Logo.png' /></a>
___

# SF Salaries Exercise 

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

** Import pandas as pd.**

In [2]:
import pandas as pd

** Read Salaries.csv as a dataframe called sal.**

In [3]:
df = pd.read_csv("Salaries.csv")

** Check the head of the DataFrame. **

In [4]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

**What is the average BasePay ?**

In [9]:
df.groupby("BasePay").mean()

C:\Users\dbda\AppData\Local\Temp\ipykernel_10344\4210583879.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("BasePay").mean()

,Id,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
BasePay,,,,,,,,,
-166.01,72833.0,249.02,0.00,6.56,83.01,89.57,2012.0,NaN,NaN
-121.63,72866.0,182.70,0.00,5.44,61.07,66.51,2012.0,NaN,NaN
-109.22,72873.0,163.83,0.00,4.32,54.61,58.93,2012.0,NaN,NaN
-106.60,72875.0,159.90,0.00,4.66,53.30,57.96,2012.0,NaN,NaN
-101.88,72879.0,153.08,0.00,4.55,51.20,55.75,2012.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
313312.52,72932.0,0.00,0.00,82319.51,313312.52,395632.03,2013.0,NaN,NaN
313686.01,72927.0,0.00,23236.00,85431.39,336922.01,422353.40,2013.0,NaN,NaN
315572.01,72930.0,0.00,0.00,82849.66,315572.01,398421.67,2013.0,NaN,NaN
318835.49,110533.0,10712.95,60563.54,89540.23,390111.98,479652.21,2014.0,NaN,NaN
319275.01,72926.0,0.00,20007.06,86533.21,339282.07,425815.28,2013.0,NaN,NaN

In [16]:
df['BasePay'].mean()

66325.4488404877

66325.44884050643

** What is the highest amount of OvertimePay in the dataset ? **

In [10]:
df.groupby("OvertimePay").max()

,Id,EmployeeName,JobTitle,BasePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
OvertimePay,,,,,,,,,,,,
-0.01,90715,Claudia M Sanchez,Senior Eligibility Worker,75033.03,1540.00,28864.64,76573.02,105437.66,2013,NaN,San Francisco,NaN
0.00,148654,Zuri Jones,ZOO CURATOR,319275.01,400184.25,96570.66,567595.43,567595.43,2014,NaN,San Francisco,NaN
0.02,44426,Leonid Vaynshteyn,Maintenance Planner,97435.01,9587.68,41501.43,107022.71,148524.14,2012,NaN,San Francisco,NaN
0.52,99025,Pamela J Walker,Deputy Sheriff,48955.57,5090.12,17354.01,54046.21,71400.22,2013,NaN,San Francisco,NaN
0.77,33722,JANIEN BISHOP,PUBLIC SERVICE AIDE-SPECIAL PROGRAMS,3940.53,26.07,NaN,3967.37,3967.37,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
173547.73,110575,Antonio B Santiago,Deputy Sheriff,94191.04,19740.81,38238.57,287479.58,325718.15,2014,NaN,San Francisco,NaN
192424.49,36164,Frederick Binkley,EMT/Paramedic/Firefighter,126863.19,17917.18,44438.25,337204.86,381643.11,2012,NaN,San Francisco,NaN
196689.18,72965,Whitney P Yee,Deputy Sheriff,95123.00,16622.66,36125.49,308434.84,344560.33,2013,NaN,San Francisco,NaN
220909.48,36160,Gary Altenberg,"Lieutenant, Fire Suppression",128808.87,13126.31,44430.12,362844.66,407274.78,2012,NaN,San Francisco,NaN
245131.88,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

In [15]:
df['OvertimePay'].max()

245131.88

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [19]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [23]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?**

In [7]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [8]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [88]:
df.groupby("Year").mean()['BasePay']

C:\Users\dbda\AppData\Local\Temp\ipykernel_16424\2680803879.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Year").mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [14]:
df_y = df.groupby("Year").mean()
df_y['BasePay']

C:\Users\dbda\AppData\Local\Temp\ipykernel_16424\4245898053.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_y = df.groupby("Year").mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [15]:
df.groupby("Year").mean().['BasePay']

SyntaxError: invalid syntax (1940112716.py, line 1)

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

** How many unique job titles are there? **

In [21]:
df['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [22]:
df['JobTitle'].nunique()

2159

2159

** What are the top 5 most common jobs? **

In [29]:
df['JobTitle'].value_counts()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [89]:
sum()

202

In [64]:
df_2013 = df[df['Year'] == 2013]
counts = (df_2013['JobTitle'].value_counts() == 1) 
my_df = pd.DataFrame()
# for i in counts:
#     if (int(counts) == 1):
#         count += 1
if counts:
    my_df = counts
my_df

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

202

** How many people have the word Chief in their job title? (This is pretty tricky) **

In [80]:
df['JobTitle']

0         GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                        CAPTAIN III (POLICE DEPARTMENT)
2                        CAPTAIN III (POLICE DEPARTMENT)
3                   WIRE ROPE CABLE MAINTENANCE MECHANIC
4           DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
                               ...
148649                                         Custodian
148650                                      Not provided
148651                                      Not provided
148652                                      Not provided
148653                        Counselor, Log Cabin Ranch
Name: JobTitle, Length: 148654, dtype: object

In [77]:
count_c = df['JobTitle'].str.count(r'(.*Chief.*)') == True
count_c.count()

148654

In [99]:
sum(df['JobTitle'].str.count(r'(.*[Cc]hief.*)'))

423

In [100]:
def count_cheif(title):
    if 'chief' in title.lower():
        return True
    else:
        return False

In [101]:
sum(df['JobTitle'].apply(lambda x:count_cheif(x)))

627

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

In [86]:
df['J_Len'] = df['JobTitle'].str.len()
df['J_Len'].corr(df['TotalPayBenefits'])

-0.03687844593260676

In [106]:
df[['J_Len','TotalPayBenefits']].corr()

                     J_Len  TotalPayBenefits
J_Len             1.000000         -0.036878
TotalPayBenefits -0.036878          1.000000

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

# Great Job!